### module 4, data cleaning with pandas
- we use pandas to clean data
- pandas: python data analysis library (panel data)
- Series
- Dataframe
- data indexing and slicing
- other operations
    1. missing data
    2. merge datasets
    3. aggregation (max, min, standard deviation)

In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'E:\\DataScience\\Python'

In [3]:
## series
ser1 = pd.Series([1,23,56,58])
ser1       # there is an explicit index for a series

0     1
1    23
2    56
3    58
dtype: int64

In [4]:
arr1 = np.arange(4)
arr1       # there is no explicit index for an array

array([0, 1, 2, 3])

In [5]:
ser1

0     1
1    23
2    56
3    58
dtype: int64

In [6]:
ser1.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
ser1.values

array([ 1, 23, 56, 58], dtype=int64)

In [8]:
ser1.index = ["a","b","c","d"]
ser1

a     1
b    23
c    56
d    58
dtype: int64

In [9]:
# ser1 has two sets of index
# explicit index  = ["a", "b", "c", "d"]
# implicit index = [0, 1, 2, 3]

ser1.name = "A series"
ser1

a     1
b    23
c    56
d    58
Name: A series, dtype: int64

In [10]:
dict1 = {"a":1, "b":20, "c":30 , "d": 40}
ser1 = pd.Series(dict1)
ser1

a     1
b    20
c    30
d    40
dtype: int64

In [11]:
ser1.sort_values(ascending = False)

d    40
c    30
b    20
a     1
dtype: int64

In [12]:
ser1.sort_index(ascending = False)

d    40
c    30
b    20
a     1
dtype: int64

In [13]:
ser2 = ser1.copy()
ser2

a     1
b    20
c    30
d    40
dtype: int64

In [28]:
## after series, we talk about data frame
data = np.random.randn(20).reshape(4,5)                   
# 20 numbers from standard normal distribution, reshape it into 4*5
df = pd.DataFrame(data)
df.columns = ["A", "B", "C", "D", "E"]
df

          A         B         C         D         E
0  1.454486  1.051106  1.111649 -0.450883  0.924169
1 -1.080258 -0.614824  0.074063 -0.142520  0.728181
2  1.094648  0.457748  0.960667 -1.123588  1.742081
3 -0.516915  0.464283  0.814589 -0.269512 -0.511457

In [29]:
###  ["A", "B", "C", "D", "E"] are columns, columns in the dataframe are variables
# rows are 0,1,2,3, rows are the index of the dataframe.
# index refers to which sample
print(df.index)
print(df.columns)
print(len(df))      # how many rows, length of df tells us the sample size
print(df.shape)     # how many rows = 4 (sample size),  how many columns = 5 (5 variables)

RangeIndex(start=0, stop=4, step=1)
Index(['A', 'B', 'C', 'D', 'E'], dtype='object')
4
(4, 5)

In [30]:
### very easy to create a new column using pandas
df["index"] = [1,2,3,4]
df

          A         B         C         D         E  index
0  1.454486  1.051106  1.111649 -0.450883  0.924169      1
1 -1.080258 -0.614824  0.074063 -0.142520  0.728181      2
2  1.094648  0.457748  0.960667 -1.123588  1.742081      3
3 -0.516915  0.464283  0.814589 -0.269512 -0.511457      4

In [31]:
df = df.set_index("index")
df

              A         B         C         D         E
index
1      1.454486  1.051106  1.111649 -0.450883  0.924169
2     -1.080258 -0.614824  0.074063 -0.142520  0.728181
3      1.094648  0.457748  0.960667 -1.123588  1.742081
4     -0.516915  0.464283  0.814589 -0.269512 -0.511457

In [32]:
df.reset_index(inplace = True)     # inplace = True     to change the original dataset.

In [33]:
df

   index         A         B         C         D         E
0      1  1.454486  1.051106  1.111649 -0.450883  0.924169
1      2 -1.080258 -0.614824  0.074063 -0.142520  0.728181
2      3  1.094648  0.457748  0.960667 -1.123588  1.742081
3      4 -0.516915  0.464283  0.814589 -0.269512 -0.511457

In [35]:
### create a dataframe from dictionary
age = {"Peter": 35,  "Mary":22, "Tom": 18}
experience = {"Peter":15, "Mary": 3, "Tom":2}
df = pd.DataFrame({"Age":age, "Years working": experience})    
# inside the (), you put in a dictionary
df

       Age  Years working
Peter   35             15
Mary    22              3
Tom     18              2

In [36]:
df.index

Index(['Peter', 'Mary', 'Tom'], dtype='object')

In [37]:
df.columns

Index(['Age', 'Years working'], dtype='object')

### indexing and slicing for series and dataframe

In [39]:
ser1 = pd.Series([1,25,60,59,21])
ser1.index = ["a","e","c","g","f"]
ser1

a     1
e    25
c    60
g    59
f    21
dtype: int64

In [40]:
## there two sets of index for a series,
# explicit ["a","e","c", "g", "f"]         implict = [0,1,2,3,4]
ser1.loc["c"]

60

In [41]:
ser1.loc["f"]    # you are using explicit index

21

In [42]:
print(ser1.loc["a"])
print(ser1.iloc[0])

1
1

In [43]:
# slicing
ser1.iloc[0:2]   # tells you the values of the 0th and 1st rows

a     1
e    25
dtype: int64

In [44]:
ser1.loc["a":"e"]      # access the rows for index = "a" and "e"

a     1
e    25
dtype: int64

In [45]:
ser1.loc[["a","g"]]

a     1
g    59
dtype: int64

In [46]:
# indexing and slicing for Dataframe
data = np.random.randn(20).reshape(4,5)
df = pd.DataFrame(data)
df.columns = ["A","B","C","D","E"]
df

          A         B         C         D         E
0  0.315300 -0.294969 -0.294001 -2.517306 -1.141934
1 -1.124896 -1.485027  0.862598  0.229283  0.392321
2  1.072191 -0.195737 -1.093963 -0.135822  1.374114
3 -0.916866 -1.148533 -0.003807 -1.219967  1.100891

In [47]:
df["index"] = ["i", "ii","iii","iv"]
df

          A         B         C         D         E index
0  0.315300 -0.294969 -0.294001 -2.517306 -1.141934     i
1 -1.124896 -1.485027  0.862598  0.229283  0.392321    ii
2  1.072191 -0.195737 -1.093963 -0.135822  1.374114   iii
3 -0.916866 -1.148533 -0.003807 -1.219967  1.100891    iv

In [48]:
df.set_index("index", inplace= True)
df

              A         B         C         D         E
index
i      0.315300 -0.294969 -0.294001 -2.517306 -1.141934
ii    -1.124896 -1.485027  0.862598  0.229283  0.392321
iii    1.072191 -0.195737 -1.093963 -0.135822  1.374114
iv    -0.916866 -1.148533 -0.003807 -1.219967  1.100891

In [49]:
# implicit index of the dataframe is [0,1,2,3]
# explicit index of the dataframe is [i, ii, iii, iv]
df.iloc[1]      # second row, this is a series

A   -1.124896
B   -1.485027
C    0.862598
D    0.229283
E    0.392321
Name: ii, dtype: float64

In [50]:
df.loc["ii"]     # second row, using the explicit index  = "ii"

A   -1.124896
B   -1.485027
C    0.862598
D    0.229283
E    0.392321
Name: ii, dtype: float64

In [51]:
## to get a particular column
df["B"]     # give you a column with name "B", no loc, or iloc
##     df["B"]  is a Series

index
i     -0.294969
ii    -1.485027
iii   -0.195737
iv    -1.148533
Name: B, dtype: float64

Create the following series.
	a    0.25
	b    0.50
	c    0.75
	d    1.00
	dtype: float64

In [52]:
ser2 = pd.Series([0.25,0.5,0.75,1.00])
ser2.index = ["a","b","c","d"]
ser2

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

(a)	use loc to access the elements indexed from “b” to “c”
(b)	use iloc to access the 2nd and 4th elements.
(c)	Rename the index of the series to “i", “ii”, “iii”, “iv”.

In [54]:
print(ser2.loc["b":"c"])
print(ser2.iloc[[1,3]])

b    0.50
c    0.75
dtype: float64
b    0.5
d    1.0
dtype: float64

In [55]:
ser2.index = ["i","ii","iii","iv"]
ser2

i      0.25
ii     0.50
iii    0.75
iv     1.00
dtype: float64

In [56]:
# (d)	sort the series in descending order of the values.
ser2.sort_values(ascending = False)

iv     1.00
iii    0.75
ii     0.50
i      0.25
dtype: float64

In [57]:
df

              A         B         C         D         E
index
i      0.315300 -0.294969 -0.294001 -2.517306 -1.141934
ii    -1.124896 -1.485027  0.862598  0.229283  0.392321
iii    1.072191 -0.195737 -1.093963 -0.135822  1.374114
iv    -0.916866 -1.148533 -0.003807 -1.219967  1.100891

In [58]:
# access columns
df[["A","E"]]       # dataframe

              A         E
index
i      0.315300 -1.141934
ii    -1.124896  0.392321
iii    1.072191  1.374114
iv    -0.916866  1.100891

In [59]:
df[df["A"]>0]   # give you all the rows with values of A greater than 0

              A         B         C         D         E
index
i      0.315300 -0.294969 -0.294001 -2.517306 -1.141934
iii    1.072191 -0.195737 -1.093963 -0.135822  1.374114

In [ ]:
# e.g., A is salary, we want to look at the samples with salary greater than 0

In [60]:
df["C"][df["A"]>0]     ## the values of C such that the corresponding values of A are greater than 0

index
i     -0.294001
iii   -1.093963
Name: C, dtype: float64

In [62]:
pop = {"California": 38332521, "Texas": 26448193, 
       "New York": 19651127, "Florida": 19552860}
area = {"California": 423967, "Texas": 695662, 
       "New York": 141297, "Florida": 170312}
df = pd.DataFrame({"state population": pop, 
                   "state area": area})
df

            state population  state area
California          38332521      423967
Texas               26448193      695662
New York            19651127      141297
Florida             19552860      170312

(a)	show the index of the dataframe.
(b)	show the rows such that state population <20,000,000
(c)	create a new column of “state density” = state population / state area.
(d)	show the area of California
(e)	put the column “state area” as the first column.
(f)	access the last two rows of the dataframe.

In [63]:
df.index

Index(['California', 'Texas', 'New York', 'Florida'], dtype='object')

In [65]:
df[df["state population"]<20000000]    # rows with "state population"<20m

          state population  state area
New York          19651127      141297
Florida           19552860      170312

In [66]:
# (c)	create a new column of “state density” = state population / state area.
df["state density"] = df["state population"]/df["state area"]
df

            state population  state area  state density
California          38332521      423967      90.413926
Texas               26448193      695662      38.018740
New York            19651127      141297     139.076746
Florida             19552860      170312     114.806121

In [68]:
# show the area of California
df.loc["California"]["state area"]

423967.0

In [69]:
## put the column “state area” as the first column.
df = df[["state area", "state population", "state density"]]
df = df[columns2]
columns2 =

            state area  state population  state density
California      423967          38332521      90.413926
Texas           695662          26448193      38.018740
New York        141297          19651127     139.076746
Florida         170312          19552860     114.806121

In [70]:
# (f)	access the last two rows of the dataframe.
df.iloc[-2:]     # the last two rows.

          state area  state population  state density
New York      141297          19651127     139.076746
Florida       170312          19552860     114.806121

In [71]:
df = pd.read_csv("president_heights.csv")
df

    order                    name  height(cm)
0       1       George Washington         189
1       2              John Adams         170
2       3        Thomas Jefferson         189
3       4           James Madison         163
4       5            James Monroe         183
5       6       John Quincy Adams         171
6       7          Andrew Jackson         185
7       8        Martin Van Buren         168
8       9  William Henry Harrison         173
9      10              John Tyler         183
10     11           James K. Polk         173
11     12          Zachary Taylor         173
12     13        Millard Fillmore         175
13     14         Franklin Pierce         178
14     15          James Buchanan         183
15     16         Abraham Lincoln         193
16     17          Andrew Johnson         178
17     18        Ulysses S. Grant         173
18     19     Rutherford B. Hayes         174
19     20       James A. Garfield         183
20     21       Chester A. Arthur         183
21     23       Benjamin Harrison         168
22     25        William McKinley         170
23     26      Theodore Roosevelt         178
24     27     William Howard Taft         182
25     28          Woodrow Wilson         180
26     29       Warren G. Harding         183
27     30         Calvin Coolidge         178
28     31          Herbert Hoover         182
29     32   Franklin D. Roosevelt         188
30     33         Harry S. Truman         175
31     34    Dwight D. Eisenhower         179
32     35         John F. Kennedy         183
33     36       Lyndon B. Johnson         193
34     37           Richard Nixon         182
35     38             Gerald Ford         183
36     39            Jimmy Carter         177
37     40           Ronald Reagan         185
38     41       George H. W. Bush         188
39     42            Bill Clinton         188
40     43          George W. Bush         182
41     44            Barack Obama         185

In [72]:
df.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [73]:
df.tail()

    order               name  height(cm)
37     40      Ronald Reagan         185
38     41  George H. W. Bush         188
39     42       Bill Clinton         188
40     43     George W. Bush         182
41     44       Barack Obama         185

In [74]:
df.head(8)    # first 8 rows

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183
5      6  John Quincy Adams         171
6      7     Andrew Jackson         185
7      8   Martin Van Buren         168

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       42 non-null     int64
 1   name        42 non-null     object
 2   height(cm)  42 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.1+ KB

In [76]:
##  pleses don't do that      df1 = df  
df.index

RangeIndex(start=0, stop=42, step=1)

In [77]:
df.columns

Index(['order', 'name', 'height(cm)'], dtype='object')

In [79]:
### find the presidents with height > 190
df["name"][df["height(cm)"]>190]

15      Abraham Lincoln
33    Lyndon B. Johnson
Name: name, dtype: object

In [80]:
df["name"].sort_values()                   #  it  is  a series

15           Abraham Lincoln
6             Andrew Jackson
16            Andrew Johnson
41              Barack Obama
21         Benjamin Harrison
39              Bill Clinton
27           Calvin Coolidge
20         Chester A. Arthur
31      Dwight D. Eisenhower
29     Franklin D. Roosevelt
13           Franklin Pierce
38         George H. W. Bush
40            George W. Bush
0          George Washington
35               Gerald Ford
30           Harry S. Truman
28            Herbert Hoover
19         James A. Garfield
14            James Buchanan
10             James K. Polk
3              James Madison
4               James Monroe
36              Jimmy Carter
1                 John Adams
32           John F. Kennedy
5          John Quincy Adams
9                 John Tyler
33         Lyndon B. Johnson
7           Martin Van Buren
12          Millard Fillmore
34             Richard Nixon
37             Ronald Reagan
18       Rutherford B. Hayes
23        Theodore Roosevelt
2           Thomas Jefferson
17          Ulysses S. Grant
26         Warren G. Harding
8     William Henry Harrison
24       William Howard Taft
22          William McKinley
25            Woodrow Wilson
11            Zachary Taylor
Name: name, dtype: object

###  
- handle  missing data
- homework assignment 4A

### missing data
- a dataframe contains a lot of missing data
- missing data is a big problem for machine learning. machine learning cannot handle missing data
- there are many ways to handle missing data

In [81]:
ser1 = pd.Series([1, np.nan, "Hello", None])     # there are two kinds of missing data
ser1

0        1
1      NaN
2    Hello
3     None
dtype: object

In [82]:
ser1.isnull()    # check any missing data

0    False
1     True
2    False
3     True
dtype: bool

In [83]:
ser1.isnull().any()      # ser1 contains some missing data.

True

In [84]:
ser1.isnull().sum()    # count how many missing values ser1 has

2

In [85]:
df = pd.DataFrame([[1, np.nan,2],
                  [2,3,5],
                  [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [86]:
df.columns = ["A", "B", "C"]
df

     A    B  C
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [88]:
df.isnull().any()     # it tells you for each column, if there are any missing values.

A     True
B     True
C    False
dtype: bool

In [91]:
# first way: drop it
df.dropna()       # this drops rows with any missing data points. this will not replace the original

     A    B  C
1  2.0  3.0  5

In [92]:
df

     A    B  C
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [93]:
df.dropna(axis = 1)      # axis = 0: rows,     axis = 1: columns

   C
0  2
1  5
2  6

In [94]:
df["D"] = None
df

     A    B  C     D
0  1.0  NaN  2  None
1  2.0  3.0  5  None
2  NaN  4.0  6  None

In [95]:
df.dropna(axis=1, how="all")      # you will drop the columns with all values being missing

     A    B  C
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [96]:
### second way to handle missing data: fill the missing values
df

     A    B  C     D
0  1.0  NaN  2  None
1  2.0  3.0  5  None
2  NaN  4.0  6  None

In [99]:
df.fillna(0, inplace=True)
df["D"]

0    0
1    0
2    0
Name: D, dtype: int64

In [100]:
### Assignment 4A
df = pd.read_csv("Banking_Marketing.csv")
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y
0,44.0,blue-collar,married,basic.4y,unknown,yes,no,cellular,aug,thu,...,1,999,0,nonexistent,1.4,93.444,-36.1,4.963,5228.1,0
1,53.0,technician,married,unknown,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-0.1,93.200,-42.0,4.021,5195.8,0
2,28.0,management,single,university.degree,no,yes,no,cellular,jun,thu,...,3,6,2,success,-1.7,94.055,-39.8,0.729,4991.6,1
3,39.0,services,married,high.school,no,no,no,cellular,apr,fri,...,2,999,0,nonexistent,-1.8,93.075,-47.1,1.405,5099.1,0
4,55.0,retired,married,basic.4y,no,yes,no,cellular,aug,fri,...,1,3,1,success,-2.9,92.201,-31.4,0.869,5076.2,1

In [101]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41199 entries, 0 to 41198
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41197 non-null  float64
 1   job             41199 non-null  object
 2   marital         41199 non-null  object
 3   education       41199 non-null  object
 4   default         41199 non-null  object
 5   housing         41199 non-null  object
 6   loan            41199 non-null  object
 7   contact         41193 non-null  object
 8   month           41199 non-null  object
 9   day_of_week     41199 non-null  object
 10  duration        41192 non-null  float64
 11  campaign        41199 non-null  int64
 12  pdays           41199 non-null  int64
 13  previous        41199 non-null  int64
 14  poutcome        41199 non-null  object
 15  emp_var_rate    41199 non-null  float64
 16  cons_price_idx  41199 non-null  float64
 17  cons_conf_idx   41199 non-null  float64
 18  euribor3m       41199 non-null  float64
 19  nr_employed     41199 non-null  float64
 20  y               41199 non-null  int64
dtypes: float64(7), int64(4), object(10)
memory usage: 6.6+ MB

In [102]:
df.describe()     # show you some statistics of all numerical columns

,age,duration,campaign,pdays,previous,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y
count,41197.000000,41192.000000,41199.000000,41199.000000,41199.000000,41199.000000,41199.000000,41199.000000,41199.000000,41199.000000,41199.000000
mean,40.023812,258.274762,2.567514,962.485206,0.172941,0.081900,93.575650,-40.502002,3.621336,5167.036455,0.112648
std,10.434966,259.270089,2.769719,186.886905,0.494859,1.570971,0.578845,4.628524,1.734431,72.249592,0.316166
min,1.000000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.634000,4963.600000,0.000000
25%,32.000000,102.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.344000,5099.100000,0.000000
50%,38.000000,180.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000,0.000000
75%,47.000000,319.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000,0.000000
max,104.000000,4918.000000,56.000000,999.000000,7.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000,1.000000

In [103]:
df["education"].value_counts()    # especially for string variables

university.degree      12170
high.school             9521
basic.9y                6045
professional.course     5244
basic.4y                4176
basic.6y                2292
unknown                 1731
illiterate                18
Basic                      2
Name: education, dtype: int64

In [ ]:
 #  basic     6045+4176+2292+2